[
  {
    "uuid": "event1",
    "name": "Welcome Week Bash",
    "startTime": "2024-09-16T15:00:00Z",
    "endTime": "2024-09-16T20:00:00Z",
    "userId": "studentUnion",
    "description": "Kick off the academic year with live music, fun activities, and a chance to meet new friends!",
    "extendedDescription": "Join the entire campus community to celebrate the start of a new academic year at the Welcome Week Bash. Enjoy a wide range of musical performances, interactive games, and food stalls. Perfect for making new friends and getting involved in campus life!",
    "image": null
  },
  {
    "uuid": "event2",
    "name": "Tech Hackathon",
    "startTime": "2024-09-20T10:00:00Z",
    "endTime": "2024-09-20T22:00:00Z",
    "userId": "csClub",
    "description": "Challenge yourself at our annual hackathon with a chance to win prizes and network with tech professionals.",
    "extendedDescription": "The annual Tech Hackathon invites coding enthusiasts to compete in a thrilling challenge. Solve problems, develop innovative solutions, and network with industry leaders. Prizes include tech gadgets, internships, and more!",
    "image": null
  },
  {
    "uuid": "event3",
    "name": "Cultural Festival",
    "startTime": "2024-10-04T12:00:00Z",
    "endTime": "2024-10-04T18:00:00Z",
    "userId": "intlStudentsAssoc",
    "description": "Explore diverse cultures with food stalls, traditional performances, and crafts.",
    "extendedDescription": "This vibrant festival showcases the rich cultural diversity of our campus with performances from around the world, authentic cuisine, and artisan crafts. A day of education, celebration, and fun for everyone.",
    "image": null
  },
  {
    "uuid": "event4",
    "name": "Sustainability Drive",
    "startTime": "2024-10-18T09:00:00Z",
    "endTime": "2024-10-18T15:00:00Z",
    "userId": "ecoClub",
    "description": "Join us for a day of workshops and activities aimed at promoting sustainability on campus.",
    "extendedDescription": "Participate in interactive workshops and discussions on sustainability topics, including waste reduction, renewable energy, and sustainable agriculture. Learn how you can contribute to a greener campus and world.",
    "image": null
  },
  {
    "uuid": "event5",
    "name": "Career Fair",
    "startTime": "2024-11-05T10:00:00Z",
    "endTime": "2024-11-05T16:00:00Z",
    "userId": "careerServices",
    "description": "Meet top employers and learn about potential career paths in various industries.",
    "extendedDescription": "Connect with potential employers from a variety of fields, receive career advice, and make valuable contacts. Bring your resume and prepare for on-the-spot interviews and internship offers.",
    "image": null
  },
  {
    "uuid": "event6",
    "name": "Mental Health Awareness Day",
    "startTime": "2024-11-12T10:00:00Z",
    "endTime": "2024-11-12T16:00:00Z",
    "userId": "healthWellness",
    "description": "Participate in workshops and activities designed to promote mental well-being and resilience.",
    "extendedDescription": "Dedicated to raising awareness about mental health issues, this event features workshops on mindfulness, stress management, and emotional resilience. Resources and support for mental health will be available.",
    "image": null
  },
  {
    "uuid": "event7",
    "name": "Sports Tournament",
    "startTime": "2024-11-22T10:00:00Z",
    "endTime": "2024-11-22T17:00:00Z",
    "userId": "athleticsDept",
    "description": "Compete or cheer in our campus-wide sports day. Open to all skill levels.",
    "extendedDescription": "Our annual Sports Tournament features team competitions in basketball, soccer, and more. Whether you're competing or just cheering, it's a great way to showcase school spirit and athletic prowess.",
    "image": null
  },
  {
    "uuid": "event8",
    "name": "Film Screening Night",
    "startTime": "2024-12-05T19:00:00Z",
    "endTime": "2024-12-05T22:00:00Z",
    "userId": "filmSociety",
    "description": "Join us for a night under the stars watching recent blockbusters and classic films.",
    "extendedDescription": "Enjoy an outdoor cinema experience featuring a selection of blockbuster hits and timeless classics. Bring a blanket, grab some popcorn, and enjoy a movie under the stars.",
    "image": null
  },
  {
    "uuid": "event9",
    "name": "Entrepreneurship Workshop",
    "startTime": "2024-12-13T13:00:00Z",
    "endTime": "2024-12-13T17:00:00Z",
    "userId": "businessClub",
    "description": "Learn from successful entrepreneurs and gain insights into starting your own business.",
    "extendedDescription": "This workshop offers practical advice, strategies, and inspiration from successful entrepreneurs. Ideal for aspiring business owners and innovators.",
    "image": null
  },
  {
    "uuid": "event10",
    "name": "Open Mic Night",
    "startTime": "2024-12-18T19:00:00Z",
    "endTime": "2024-12-18T21:00:00Z",
    "userId": "artsCollective",
    "description": "Showcase your talents or enjoy a night of performances from your peers at our monthly open mic event.",
    "extendedDescription": "Our Open Mic Night is a platform for students to express themselves through music, poetry, and storytelling. Come and discover the hidden talents within our community.",
    "image": null
  }
]
